Revit 2024 API
Generic.GenericBumpAmount Property
 The property labeled "Amount" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericBumpAmount { get; }
Visual Basic
Public Shared ReadOnly Property GenericBumpAmount As String
	Get
Visual C++
public:
static property String^ GenericBumpAmount {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "-1000, 1000".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace